# SQLite Tutorial

Documentation at: https://docs.python.org/3/library/sqlite3.html

# Quire of SQLite

* Data Types .
* No Right or Full Outer Joins.
* Alter Table is very useful add, Remove , column and table name.
* Tables default to having a unique integer rowid column.
* SQLite is a library not a service.
* In-Memory Database Feature.

load the sqlite package

In [1]:
import sqlite3

print(sqlite3.sqlite_version)

3.40.1

Connect to the database.

In [2]:
conn = sqlite3.connect('school.db')

In [3]:
cur = conn.cursor()
cur.execute('select * from student')

In [4]:
cur.fetchone()

(1,
 'alyar',
 '2',
 'RED',
 'Male',
 'A',
 'ali',
 'pabbi',
 333,
 2000,
 345,
 1000.0,
 400.0,
 300.0,
 300.0,
 300.0,
 'Paid')

In [5]:
print(cur.fetchone())

(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')

In [7]:
for row in cur.execute('SELECT * FROM student'):
    print(row)

(1, 'alyar', '2', 'RED', 'Male', 'A', 'ali', 'pabbi', 333, 2000, 345, 1000.0, 400.0, 300.0, 300.0, 300.0, 'Paid')
(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')
(4, 'azam', '3', 'RED', 'Male', 'A', 'ali', 'pabbi', 345, 3000, 3331234567, 300.0, 0.0, 0.0, 0.0, 0.0, 'Paid')
(5, 'bacha', '5', 'RED', 'Male', 'A', 'tariq', 'pabbi', 123456789, 5000, 3331234567, 1000.0, 1000.0, 3000.0, 3000.0, 1000.0, 'Paid')
(6, 'ali khan', '1', 'RED', 'Male', 'A', 'tariq', 'pabbi', 1234567890, 1000, 3331234567, 1000.0, 500.0, 1000.0, 1000.0, 200.0, 'Paid')
(7, 'hamza', '4', 'RED', 'Male', 'A', 'tatiq', 'pabbi', 12121212, 2000, 3331234567, 1000.0, 2000.0, 2000.0, 1000.0, 1000.0, 'Paid')
(8, 'maryam', '3', 'BLUE', 'Female', 'B', 'tariq', 'pabbi', 3331234567, 1000, 3331234567, 0.0, 0.0, 0.0, 0.0, 0.0, 'Unpaid')
(9, 'alyar Tariq', '1', 'BLUE', 'Male', 'B', 'tariq', 'usman abad', 3339139164, 1000, 3331234567, 500.0, 300.0, 200.0, 1000.0, 200.0, 'Unpaid')
(10, 'nimra', '3', 'GREEN', 'Female', 'C', 'maryam', 'pabbi', 331, 2000, 3331234567, 200.0, 0.0, 200.0, 1000.0, 200.0, 'Unpaid')

In [8]:
for row in cur.execute('SELECT * FROM student limit 3'):
    print(row)

(1, 'alyar', '2', 'RED', 'Male', 'A', 'ali', 'pabbi', 333, 2000, 345, 1000.0, 400.0, 300.0, 300.0, 300.0, 'Paid')
(3, 'arfa jani', '1', 'YELLOW', 'Female', 'D', 'maryam', 'PABBI', 335, 1000, 345, 1200.0, 200.0, 1000.0, 1000.0, 400.0, 'Unpaid')
(4, 'azam', '3', 'RED', 'Male', 'A', 'ali', 'pabbi', 345, 3000, 3331234567, 300.0, 0.0, 0.0, 0.0, 0.0, 'Paid')

In [9]:
import pandas as pd

In [10]:
pd.read_sql_query('SELECT * FROM student limit 3' , conn)

,id,name,class_,section,gender,grade,teacher_name,address,contact,fee,driver_contact,transport_fee,uniform_dues,books_dues,admission_fee,paper_money,fee_status
0,1,alyar,2,RED,Male,A,ali,pabbi,333,2000,345,1000.0,400.0,300.0,300.0,300.0,Paid
1,3,arfa jani,1,YELLOW,Female,D,maryam,PABBI,335,1000,345,1200.0,200.0,1000.0,1000.0,400.0,Unpaid
2,4,azam,3,RED,Male,A,ali,pabbi,345,3000,3331234567,300.0,0.0,0.0,0.0,0.0,Paid

In [14]:
pd.read_sql_query("SELECT * FROM student where name ='alyar' " , conn)

,id,name,class_,section,gender,grade,teacher_name,address,contact,fee,driver_contact,transport_fee,uniform_dues,books_dues,admission_fee,paper_money,fee_status
0,1,alyar,2,RED,Male,A,ali,pabbi,333,2000,345,1000.0,400.0,300.0,300.0,300.0,Paid

In [16]:
pd.read_sql_query("SELECT name , section , gender , teacher_name , address FROM student where name ='alyar' " , conn)

    name section gender teacher_name address
0  alyar     RED   Male          ali   pabbi